/*
1.โปรแกรมต้องรับค่าจาก คีบอด - ผู้ใช้
2.ค่าที่รับจาก ผู้ใช้เป็น int
3.เมื่อรับมาแล้วให้เอามาบวก เลือกเฉพาะที่เป็นเลขคู่
4.รับไปเรื่อยๆจนกว่า จะป้อนเลข 0
5.ทำซ้ำกัน 3 loop
6.ทั้ง 3 loop นี้ให้อยู่ในโปรแกรมเดียวกัน
7.user จะเลือกได้ว่าเอาลูปไหน

*/


import java.util.Scanner;  // import Scanner
class Pract {  // สร้างคลาส
	public static void main(String[] args) { // สร้างเมธอด
		Scanner Keyb = new Scanner(System.in); // // สร้าง Scanner instance
		
		int input=1; // ประกาศตัวแปรสำหรับรับค่าจากผู้ใช้
		int sum = 0; // ประกาศตัวแปรสำหรับรวมค่าที่ผู้ใช้ป้อนเข้ามา
		int i=0; // ประกาศตัวแปรสำหรับหรับไว้นับจำนวนรอบของลูป
		int choice; // ประกาศตัวแปรสำหรับใช้เลือก choice
        // ---------- หน้าตาเริ่มต้นของโปรแกรม
		System.out.println("Loop Operation Program");
		System.out.println("1.For Loop");
		System.out.println("2.While Loop");
		System.out.println("3.Do While Loop");
		System.out.print("Please select your choice : > ");

		choice = Keyb.nextInt(); // รับค่า choice

		if(choice == 1){ // เงื่อนไขแรกของ choice ถ้า choice == 1
			//---------------------------------------------
			for(i=0;i!=input;){ // -- เริ่มต้น ลูป For (โดยเปรียบเทียบ ตัวแปร i กับ ค่าที่ผู้ใช้ป้อน หากไม่เท่ากัน (True)ให้ทำคำสั่งต่อไป   ถ้าหากเท่ากัน  (False) ให้หลุดออกจากลูปทันที)  
			System.out.print("For-Enter Number >: ");  // รับค่าจากผู้ใช้
				input = Keyb.nextInt(); // นำค่าจากผู้ใช้เก็บไว้ในตัวแปร input
					if(input%2==0){ // นำค่าที่ผู้ใช้ป้อน มา mod กับ 2 หาก ผลลัพธ์การ mod เท่ากับ 0 ให้ทำคำสั่งต่อไป
						sum = sum + input; // นำค่าในตัวแปร input มาบวก และ เก็บค่าไว้ในตัวแปร sum
						}
			System.out.println(sum); // แสดงผลค่า sum เพื่อเช็คผลว่าการบวกว่าถูกต้องหรือไม่
		} // ------- จบ การทำงานของลูป For
		//---------------------------------------------

		}else if(choice == 2){ // เงื่อนไขแรกของ choice ถ้า choice == 2
			//---------------------------------------------
			while(i!=input){ // -- เริ่มต้น ลูป While (ให้ทำคำสั่งถัดไปหากตัวแปร i ไม่เท่ากับ ค่า input (True) หากเท่ากัน (False) ให้ออกจากลูปทันที)
			System.out.print("While-Enter Number >: "); // รับค่าจากผู้ใช้
				input = Keyb.nextInt(); // นำค่าจากผู้ใช้เก็บไว้ในตัวแปร input
					if(input%2==0){ // นำค่าที่ผู้ใช้ป้อน มา mod กับ 2 หาก ผลลัพธ์การ mod เท่ากับ 0 ให้ทำคำสั่งต่อไป
						sum = sum + input; // นำค่าในตัวแปร input มาบวก และ เก็บค่าไว้ในตัวแปร sum
						}
			System.out.println(sum); // แสดงผลค่า sum เพื่อเช็คผลว่าการบวกว่าถูกต้องหรือไม่
					if(input==0){ // สร้างเงื่อนไขมาปรับการทำงานของลูป (หาก ค่าที่ผู้ใช้ป้อนเข้ามาเป็น 0 ให้ ค่า i เท่ากับค่า input ซึ่ง ตรรกะะเป็น False ทำให้หลุดออกจาก ลูป)
						i=input; // ปรับค่า i
					}
		
		} // ---- จบการทำงานของลูป While
		//---------------------------------------------

		}else if(choice == 3){ // เงื่อนไขแรกของ choice ถ้า choice == 3
		//---------------------------------------------
			do // เริ่มต้นลูป Do...While
				{
				System.out.print("Do..While-Enter Number >: "); // รับค่าจากผู้ใช้
				input = Keyb.nextInt(); // นำค่าจากผู้ใช้เก็บไว้ในตัวแปร input
				if(input%2==0){ // นำค่าที่ผู้ใช้ป้อน มา mod กับ 2 หาก ผลลัพธ์การ mod เท่ากับ 0 ให้ทำคำสั่งต่อไป
					sum = sum + input; // นำค่าในตัวแปร input มาบวก และ เก็บค่าไว้ในตัวแปร sum
					}
				System.out.println(sum); // แสดงผลค่า sum เพื่อเช็คผลว่าการบวกว่าถูกต้องหรือไม่
				if(input==0){ // สร้างเงื่อนไขมาปรับการทำงานของลูป (หาก ค่าที่ผู้ใช้ป้อนเข้ามาเป็น 0 ให้ ค่า i เท่ากับค่า input ซึ่ง ตรรกะะเป็น False ทำให้หลุดออกจาก ลูป)
						i=input; // ปรับค่า i
					}
		} /// ---- จบการทำงานของลูป While
		while (i!=input); //  หากตัวแปร i ไม่เท่ากับ ค่า input (True) หากเท่ากัน (False) ให้ออกจากลูปทันที
		//---------------------------------------------
		}else{ // ------ เงื่อนไข else
			System.out.print("Please slect new choice."); // แสดงข้อความ Error เนื่องจาก ผู้ใช้ป้อน input มาผิด
		
		}
			
		
		}
}
